namespace Simulation.Common.Entity.Construction;

/// <summary>
/// Стандартное здание - это тип здания, в котором можно будет размещать разные модули,
/// определяя его функциональность. Например, здание в 3 модуля : Жилой, Агрокультурный,
/// Энергетический. Это будет обычная коробка, но с комнатами как бы.
///
/// Его можно будет настроить так, чтобы оно могло содержать любое количество модулей, и
/// так же можно будет добавлять к нему другие здания, стоя их рядом, они будут
/// автоматически соединятсья с этим здание.
/// </summary>
public class StandardBuilding : ConstructionBase
{
    
}